In [1]:
import re
import warnings
import numpy as np
import pandas as pd
warnings.filterwarnings('ignore')

#### __Creating different dataframes__

In [2]:
df1 = pd.DataFrame(np.random.randint(1,15, size=(6,5)), columns=list("ABCDE"))
df1

   A   B   C   D   E
0  7   9   1  11  10
1  1   4   8  13   9
2  4   7   7   2   4
3  3  12  13  13  10
4  4  13   6   1   2
5  7  11   9   2  11

In [3]:
df2 = pd.DataFrame(np.random.randint(16,30, size=(6, 4)), columns=list("ABCD"))
df2

    A   B   C   D
0  24  29  22  20
1  23  28  23  24
2  19  29  16  26
3  25  26  27  23
4  19  23  28  22
5  22  22  26  29

In [4]:
df3 = pd.DataFrame(np.random.randint(31,45, size=(6,5)), columns=list("ABCDE"))
df3

    A   B   C   D   E
0  35  34  38  37  43
1  36  39  31  38  40
2  43  31  44  37  34
3  38  32  38  42  35
4  44  31  37  38  31
5  33  39  42  36  37

#### __Concat__

In [5]:
pd.concat([df1, df2, df3])

    A   B   C   D     E
0   7   9   1  11  10.0
1   1   4   8  13   9.0
2   4   7   7   2   4.0
3   3  12  13  13  10.0
4   4  13   6   1   2.0
5   7  11   9   2  11.0
0  24  29  22  20   NaN
1  23  28  23  24   NaN
2  19  29  16  26   NaN
3  25  26  27  23   NaN
4  19  23  28  22   NaN
5  22  22  26  29   NaN
0  35  34  38  37  43.0
1  36  39  31  38  40.0
2  43  31  44  37  34.0
3  38  32  38  42  35.0
4  44  31  37  38  31.0
5  33  39  42  36  37.0

In [6]:
pd.concat([df1, df2, df3], ignore_index=True)

     A   B   C   D     E
0    7   9   1  11  10.0
1    1   4   8  13   9.0
2    4   7   7   2   4.0
3    3  12  13  13  10.0
4    4  13   6   1   2.0
5    7  11   9   2  11.0
6   24  29  22  20   NaN
7   23  28  23  24   NaN
8   19  29  16  26   NaN
9   25  26  27  23   NaN
10  19  23  28  22   NaN
11  22  22  26  29   NaN
12  35  34  38  37  43.0
13  36  39  31  38  40.0
14  43  31  44  37  34.0
15  38  32  38  42  35.0
16  44  31  37  38  31.0
17  33  39  42  36  37.0

In [7]:
pd.concat([df1, df2, df3], axis=1)

   A   B   C   D   E   A   B   C   D   A   B   C   D   E
0  7   9   1  11  10  24  29  22  20  35  34  38  37  43
1  1   4   8  13   9  23  28  23  24  36  39  31  38  40
2  4   7   7   2   4  19  29  16  26  43  31  44  37  34
3  3  12  13  13  10  25  26  27  23  38  32  38  42  35
4  4  13   6   1   2  19  23  28  22  44  31  37  38  31
5  7  11   9   2  11  22  22  26  29  33  39  42  36  37

#### __Joins__

In [8]:
pd.concat([df1,df2],join = 'outer')

    A   B   C   D     E
0   7   9   1  11  10.0
1   1   4   8  13   9.0
2   4   7   7   2   4.0
3   3  12  13  13  10.0
4   4  13   6   1   2.0
5   7  11   9   2  11.0
0  24  29  22  20   NaN
1  23  28  23  24   NaN
2  19  29  16  26   NaN
3  25  26  27  23   NaN
4  19  23  28  22   NaN
5  22  22  26  29   NaN

In [9]:
pd.concat([df1,df2],join = 'inner')

    A   B   C   D
0   7   9   1  11
1   1   4   8  13
2   4   7   7   2
3   3  12  13  13
4   4  13   6   1
5   7  11   9   2
0  24  29  22  20
1  23  28  23  24
2  19  29  16  26
3  25  26  27  23
4  19  23  28  22
5  22  22  26  29

In [10]:
df3.columns = list('ACXYZ')
df3

    A   C   X   Y   Z
0  35  34  38  37  43
1  36  39  31  38  40
2  43  31  44  37  34
3  38  32  38  42  35
4  44  31  37  38  31
5  33  39  42  36  37

In [11]:
pd.concat([df2, df3])

    A     B   C     D     X     Y     Z
0  24  29.0  22  20.0   NaN   NaN   NaN
1  23  28.0  23  24.0   NaN   NaN   NaN
2  19  29.0  16  26.0   NaN   NaN   NaN
3  25  26.0  27  23.0   NaN   NaN   NaN
4  19  23.0  28  22.0   NaN   NaN   NaN
5  22  22.0  26  29.0   NaN   NaN   NaN
0  35   NaN  34   NaN  38.0  37.0  43.0
1  36   NaN  39   NaN  31.0  38.0  40.0
2  43   NaN  31   NaN  44.0  37.0  34.0
3  38   NaN  32   NaN  38.0  42.0  35.0
4  44   NaN  31   NaN  37.0  38.0  31.0
5  33   NaN  39   NaN  42.0  36.0  37.0

In [12]:
pd.concat([df2, df3], join="inner")

    A   C
0  24  22
1  23  23
2  19  16
3  25  27
4  19  28
5  22  26
0  35  34
1  36  39
2  43  31
3  38  32
4  44  31
5  33  39

#### __Joins__

In [13]:
df2, df3

(    A   B   C   D
 0  24  29  22  20
 1  23  28  23  24
 2  19  29  16  26
 3  25  26  27  23
 4  19  23  28  22
 5  22  22  26  29,
     A   C   X   Y   Z
 0  35  34  38  37  43
 1  36  39  31  38  40
 2  43  31  44  37  34
 3  38  32  38  42  35
 4  44  31  37  38  31
 5  33  39  42  36  37)

In [14]:
pd.merge(df2, df3, how="left")

    A   B   C   D   X   Y   Z
0  24  29  22  20 NaN NaN NaN
1  23  28  23  24 NaN NaN NaN
2  19  29  16  26 NaN NaN NaN
3  25  26  27  23 NaN NaN NaN
4  19  23  28  22 NaN NaN NaN
5  22  22  26  29 NaN NaN NaN

In [15]:
df2.merge(df3, how="outer")

     A     B   C     D     X     Y     Z
0   19  29.0  16  26.0   NaN   NaN   NaN
1   19  23.0  28  22.0   NaN   NaN   NaN
2   22  22.0  26  29.0   NaN   NaN   NaN
3   23  28.0  23  24.0   NaN   NaN   NaN
4   24  29.0  22  20.0   NaN   NaN   NaN
5   25  26.0  27  23.0   NaN   NaN   NaN
6   33   NaN  39   NaN  42.0  36.0  37.0
7   35   NaN  34   NaN  38.0  37.0  43.0
8   36   NaN  39   NaN  31.0  38.0  40.0
9   38   NaN  32   NaN  38.0  42.0  35.0
10  43   NaN  31   NaN  44.0  37.0  34.0
11  44   NaN  31   NaN  37.0  38.0  31.0